[
  {
    "id": "constant_triforce_hunt_extras",
    "description": "Triforce hunt always 25% extra Triforce pieces in the item pool.",
    "settings_to_skip": ["triforce_goal_per_world "],
    "settings_to_warn": []
  },
  {
    "id": "exclude_minimal_triforce_hunt",
    "description": "If Triforce hunt is enabled, exclude minimal item pool.",
    "settings_to_skip": [],
    "settings_to_warn": ["item_pool_value:minimal"]
  },
  {
    "id": "exclude_ice_trap_misery",
    "description": "If the damage multiplier is quadruple or one-hit ko, exclude ice trap mayhem and onslaught.",
    "settings_to_skip": [],
    "settings_to_warn": ["junk_ice_traps:mayhem", "junk_ice_traps:onslaught"]
  },
  {
    "id": "disable_pot_chest_texture_independence",
    "description": "Set the pot and crate textures setting to match the behavior of the chest textures.",
    "settings_to_skip": ["correct_potcrate_appearances"],
    "settings_to_warn": []
  },
  {
    "id": "disable_keysanity_independence",
    "description": "Sets the Gerudo Hideout small key shuffle setting to match the dungeon small key shuffle setting.",
    "settings_to_skip": ["shuffle_hideoutkeys"],
    "settings_to_warn": []
  },
  {
    "id": "restrict_one_entrance_randomizer",
    "description": "Ensures that there is a maximum of one entrance pool shuffled. If more than one is shuffled, one is randomly selected to keep and the others are disabled. This includes the entrance pools: interior, grotto, dungeon, and overworld.",
    "settings_to_skip": [],
    "settings_to_warn": ["shuffle_interior_entrances", "shuffle_grotto_entrances", "shuffle_dungeon_entrances", "shuffle_overworld_entrances"]
  },
  {
    "id": "random_scrubs_start_wallet",
    "description": "If random price Deku scrub shuffle is enabled, add a wallet to the starting items. You may find yourself starting with more than one if other settings have also given you a starting wallet.",
    "settings_to_skip": [],
    "settings_to_warn": []
  },
  {
    "id": "shuffle_goal_hints",
    "description": "{0} of the time, replace \"Way of the Hero\" hints with \"Goal\" hints in the selected hint distribution.",
    "settings_to_skip": [],
    "settings_to_warn": []
  },
  {
    "id": "replace_dampe_diary_hint_with_lightarrow",
    "description": "Replace the Dampe's diary hint for the hookshot with a hint for the Light Arrows.",
    "settings_to_skip": [],
    "settings_to_warn": []
  },
  {
    "id": "split_collectible_bridge_conditions",
    "description": "{0} of the time, a collectible (Gold Skulltula Tokens or Heart Containers) is chosen as the win condition. When selected, either Gold Skulltula Tokens or Heart Containers are chosen with {1} likelihoods. Finally, determine whether this should apply to the Bridge Condition, Ganon Boss Key Condition, or both with {2} likelihoods. If \"Both\" is not selected, the other win condition is chosen according to the weights given below.",
    "settings_to_skip": [],
    "settings_to_warn": ["bridge:tokens", "bridge:hearts", "shuffle_ganon_bosskey:tokens", "shuffle_ganon_bosskey:hearts"]
  },
  {
    "id": "adjust_chaos_hint_distro",
    "description": "Add duplicates for each \"always\" hint and remove the \"song\", \"dungeon\", and \"overworld\" hint categories (since these hints are already included in the \"sometimes\" category) from the chaos hint distribution.",
    "settings_to_skip": [],
    "settings_to_warn": []
  },
  {
    "id": "exclude_mapcompass_info_remove",
    "description": "If maps and compasses give info, do not allow them to be removed from the item pool.",
    "settings_to_skip": [],
    "settings_to_warn": ["shuffle_mapcompass:remove"]
  },
  {
    "id": "ohko_starts_with_nayrus",
    "description": "If the damage multiplier is one-hit ko, add Nayru's Love to the starting items.",
    "settings_to_skip": [],
    "settings_to_warn": []
  },
  {
    "id": "invert_dungeons_mq_count",
    "description": "{0} of the time, the dungeons will all be set to Master Quest and the setting for number of Master Quest dungeons will instead determine the number of vanilla dungeons.",
    "settings_to_skip": [],
    "settings_to_warn": []
  },
  {
    "id": "shuffle_valley_lake_exit",
    "description": "ONLY if both overworld entrance randomizer and owl drop shuffle are enabled, shuffle the entrance in the water leading from Gerudo Valley to Lake Hylia.",
    "settings_to_skip": ["shuffle_gerudo_valley_river_exit"],
    "settings_to_warn": []
  },
  {
    "id": "select_one_pots_crates_freestanding",
    "description": "{0} of the time, shuffle either pots, crates, OR freestanding items. Between these three options, the selected one is randomly chosen and all three options are equally likely. For the chosen setting, whether to shuffle the overworld instance, dungeon instances, or both is also chosen randomly with equal likelihoods.",
    "settings_to_skip": ["shuffle_pots", "shuffle_crates", "shuffle_freestanding_items"],
    "settings_to_warn": []
  },
  {
    "id": "geometrically_draw_dungeon_shortcuts",
    "description": "Enable for dungeon shortcuts for N randomly selected dungeons where N is drawn from a geometric distribution, i.e. 50% for 0, 25% for 1, 12.5% for 2, etc",
    "settings_to_skip": ["dungeon_shortcuts"],
    "settings_to_warn": []
  },
  {
    "id": "limit_overworld_entrances_in_mixed_entrance_pools",
    "description": "When entrance pools are mixed, overworld should only be included {0} of the time. All of the other entrance pools are always mixed if mixed pools is enabled and those entrance pools are randomized.",
    "settings_to_skip": ["mix_entrance_pools"],
    "settings_to_warn": []
  }
]